#coding=utf-8
import requests
import time
from bs4 import BeautifulSoup
import json
import re
from urllib import request

def getHtml(url):
    try:
        r = requests.get(url)
        r.encoding = r.apparent_encoding
        res = request.urlopen(url)
        return r.text, res.geturl().replace('/index.htm','/images/photo.jpg')
    except:
        try:
            return r.text, None
        except:
            return None, None


namesheet = {"1611": "张政权", "530": "程文明", "721": "冯志强", "2029": "熊昊", "523": "孙振堂", "1678": "邹应全", "1090": "陈蛇", "25": "谢延敏",
        "227": "曾家刚", "1976": "任东亚", "341": "鲁连涛", "75": "李天瑞", "1396": "王喜庆", "848": "杜海若", "342": "陆群", "47": "崔凯",
        "1232": "曾晓辉", "1363": "陈伟庆", "1918": "王俊棋", "406": "刘品", "1393": "戴焕云", "1256": "刘福生", "1623": "陈崇双",
        "1323": "王海波", "1215": "傅浩", "1817": "陈龙泉", "1397": "李异", "1370": "魏人民", "1908": "薛弼一", "1666": "张血琴",
        "1905": "冯冀蒙", "189": "郑珺", "307": "周先礼", "272": "刘运林", "1413": "杨顺利", "1939": "胡辉", "1792": "黄帅",
        "1026": "郭兰萍", "873": "孟开文", "1017": "段西凌", "2047": "张晟", "936": "宋振明", "823": "冯智敏", "903": "夏伟蓉",
        "1129": "邓小林", "294": "刘澜", "1844": "邱忠权", "420": "朱旻昊", "1251": "易思蓉", "653": "毛蓉萍", "68": "全晓娟",
        "1593": "张宏伟", "375": "龚邦明", "702": "刘继才", "1300": "姜向东", "1041": "陈晓彦", "1785": "张辉波", "435": "刘启跃",
        "2051": "黄磊", "1348": "段可", "425": "欧阳峰", "127": "何娟", "1703": "赵锐", "826": "鲁工圆", "42": "邬洪涛", "862": "王立品",
        "1345": "吴建乐", "943": "胥永刚", "1707": "张江", "2044": "刘艳", "956": "谢尚英", "1845": "罗刚", "835": "黄泽纯", "685": "张志勇",
        "1111": "戴光泽", "491": "甘霖", "1324": "宋吉荣", "928": "王毅非", "1854": "袁中原", "962": "徐伯初", "659": "刘成龙",
        "1353": "潘绍伟", "696": "喻凯", "1909": "宋冬利", "218": "李翔宇", "1795": "杨洋", "1576": "彭博", "135": "薛长虹", "518": "秦小林",
        "1652": "王衡禹", "1390": "周文祥", "331": "黄远新", "1977": "张光远", "1293": "桂富强", "1760": "杨维清", "2030": "张欣",
        "185": "王平", "18": "刘志刚", "2045": "任凯利", "2069": "陈蛟", "1379": "李固华", "831": "晏启祥", "147": "陈帆", "1700": "叶佳",
        "732": "倪少权", "1124": "魏琼", "1344": "张胜", "381": "付茂海", "1861": "王峰", "1139": "刘林沙", "921": "黄小红",
        "1029": "杨彦克", "1975": "杨鶤", "1654": "张涵", "1426": "梅红", "1874": "徐辉", "1098": "周国华", "443": "邹益胜",
        "1670": "周张义", "454": "周凌远", "1091": "杨莉", "1156": "黄昕恺", "1667": "靖永志", "1190": "许惟国", "2053": "康啊真",
        "1565": "但鸽", "1737": "郑狄", "1596": "符玲", "681": "汪晓宁", "388": "陈春俊", "971": "胡杨", "94": "龚勋", "937": "赵静",
        "2023": "向韬", "117": "李孝红", "407": "范小明", "1321": "王庆利", "23": "庞烈鑫", "663": "宋伶俐", "292": "王平", "1657": "李怀仙",
        "19": "邹喜华", "1322": "黄泽文", "247": "徐利华", "1136": "胡汉春", "1569": "朱炜", "2055": "胡丽娜", "750": "耿耘",
        "1536": "陈晓红", "2042": "方修洋", "1903": "刘伟渭", "352": "顾水涛", "1728": "王恪铭", "855": "刘学毅", "1030": "陈国强",
        "418": "杨明", "176": "蒋晗", "87": "袁林果", "1807": "代彬", "558": "王沁", "959": "唐元宁", "316": "杨扬", "1917": "张恒",
        "1299": "徐轶", "1731": "熊嘉阳", "905": "周立荣", "1650": "杨文波", "1424": "朱立元", "616": "杨翊仁", "1149": "黄涛",
        "412": "邓斌", "1358": "胡劲松", "1761": "王玮", "12": "贺玉龙", "402": "潘小东", "348": "李春茂", "698": "谭德庆", "818": "吕军",
        "596": "李春梅", "654": "丁浩", "49": "冯涛", "1280": "尹紫红", "917": "张英波", "1114": "蒋关鲁", "1997": "石磊", "1904": "何星星",
        "2010": "刘艳秋", "559": "任平弟", "37": "周祚万", "246": "左辅强", "392": "闫海峰", "856": "彭小春", "1771": "赵小娟", "872": "黄孝伦",
        "1290": "罗仁", "541": "李亚东", "846": "吴风云", "299": "潘亦苏", "1429": "汤理", "255": "文登敏", "573": "赵乘寿", "321": "杨成良",
        "35": "郭志云", "193": "屈树新", "419": "黄丁发", "1361": "刘东民", "1257": "邓大鸣", "318": "刘爱军", "757": "魏宇", "1097": "肖守讷",
        "1940": "张程菘", "787": "李永建", "613": "刘秀峰", "1406": "王茜", "1714": "肖林", "1044": "张蓉", "1087": "唐怀平",
        "153": "韦联福", "1392": "朱志国", "1472": "翟婉明", "1266": "黄文培", "398": "邓绍高", "207": "张红", "27": "李小珍",
        "2015": "赵东平", "371": "张玉春", "241": "陈宁", "503": "饶兴贵", "772": "左德元", "720": "李强", "1673": "杨帆", "815": "卿铭",
        "315": "刘昱岗", "1171": "蒋洪林", "632": "王广俊", "327": "李炜", "733": "刘家琨", "312": "李宗文", "1768": "顾国祥", "1735": "谢敏",
        "1211": "吴静", "603": "杨坤丽", "642": "王盛民", "1157": "王齐荣", "1270": "张忠平", "324": "米彩盈", "2067": "许永生",
        "1813": "樊明书", "1055": "徐涛", "1691": "苟国庆", "1305": "徐志根", "728": "孟涛", "1551": "窦祥胜", "1948": "宋兴国",
        "1024": "唐亚雄", "403": "吴冲", "736": "傅攀", "533": "王蔚", "1537": "刘静", "1411": "景凤娟", "529": "杨永清", "397": "赵炜",
        "330": "何朝明", "766": "王承竞", "1820": "张亚东", "333": "戴朝华", "1541": "范婷", "783": "林晶晶", "1281": "蔡成标", "438": "赵成",
        "2068": "范翠玲", "1409": "杨铁宝", "1894": "类先富", "1019": "何林", "1399": "陈鹏", "129": "苏启旺", "1866": "陶思宇",
        "889": "宋小欣", "357": "高凡", "270": "赵晓彦", "1036": "舒群", "1508": "张志佑", "1132": "郑爽英", "1053": "毛慧", "549": "成志强",
        "350": "邓自刚", "788": "李福海", "638": "赵强", "539": "崔珩", "729": "胡培", "1641": "程凤", "979": "张星辉", "196": "龚自正",
        "264": "陈俊周", "1495": "samart powpaka", "1056": "姜辉东", "1643": "李君", "1539": "陈思本", "190": "童晓阳", "457": "谭书敏",
        "1901": "廖昕", "1527": "熊燕宇", "1697": "杨涛", "548": "李立", "867": "蔡婧", "531": "张洁", "284": "苟先太", "684": "丁桂保",
        "1100": "彭雄志", "1630": "向乾尹", "1587": "高国强", "938": "王萃娟", "1174": "杨顺生", "2012": "蒋丹凌", "1639": "贾文志",
        "1561": "王世海", "1784": "韩志伟", "802": "李彤梅", "1016": "童荣生", "1433": "经福谦", "1985": "孙燕云", "2085": "杨蔡进",
        "500": "韩鹏", "1173": "韩文丽", "123": "刘炜", "1227": "刘建新", "254": "姚远", "817": "邓平", "1494": "曾波", "1778": "刘光帅",
        "1031": "郭清波", "1195": "黄玉芳", "2002": "于超", "1121": "张俊儒", "1591": "陈剑波", "1346": "刘人怀", "336": "罗贇",
        "1933": "刘刚", "1965": "刘弘涛", "339": "罗霞", "1556": "易红", "1867": "范春梅", "1431": "王一帆", "319": "王鹰", "1275": "周静",
        "854": "朱冬梅", "747": "程放明", "1982": "李维萍", "233": "蔡振兵", "1599": "蒋合众", "1743": "张政权", "714": "史朝阳",
        "1597": "麦瑞坤", "1384": "张骥翼", "540": "蔡燕歆", "211": "陈凯亚", "1546": "龚潇", "82": "舒泽亮", "927": "张秀峰", "1864": "杨柳",
        "1559": "蔡玉波", "2017": "马传平", "1822": "朱云芳", "1480": "袁俭", "1526": "罗希", "1811": "刘金铃", "1462": "王书会",
        "243": "冯勋省", "2032": "何刘", "1634": "张建军", "2073": "王战江", "2033": "杨矫", "781": "吴松荣", "362": "肖绯雄", "760": "赵雷",
        "866": "苏燕辰", "1957": "崔宁伟", "1919": "林娜", "139": "任娟娟", "125": "曾淼", "1990": "张春梅", "1180": "冷彪", "577": "毛敏",
        "1504": "叶琳", "1418": "李英", "45": "申玉生", "266": "杨丹", "605": "黄国庆", "622": "李百毅", "1476": "刘名扬", "635": "汤银英",
        "1051": "赵正佳", "372": "张开冉", "174": "彭代渊", "1741": "郑海莎", "1248": "涂锦", "1748": "郑浩生", "1422": "李家伦",
        "424": "饶世权", "582": "刘菲", "584": "刘赤贞", "1310": "邱春蓉", "662": "王晓南", "1105": "熊祥正", "1252": "牟雁东",
        "1530": "陈动英", "363": "刘占祥", "1653": "荣海娜", "1584": "程中兴", "1906": "李里", "643": "刘放", "768": "陆阳", "413": "李国旗",
        "1116": "封坤", "1061": "谢瑜", "939": "王剑虹", "1057": "徐静村", "1278": "吕小平", "138": "赵春发", "389": "马术文",
        "722": "丁渭平", "164": "马征", "1072": "杨荣山", "358": "文江泉", "837": "兰萍", "365": "冯炼", "507": "周兴华", "1505": "王俊棋",
        "296": "陈俊英", "1603": "马红波", "1952": "张锐", "1542": "肖虹", "586": "杨美传", "1800": "韦凯", "1708": "宗桦", "919": "熊列彬",
        "194": "羊新胜", "804": "洪毅", "1549": "应阿妮", "1534": "曾鸿燕", "1126": "罗强", "28": "宋小林", "1581": "马珩", "1912": "王静",
        "565": "朱峰", "1606": "张健穹", "853": "张小强", "762": "李乔", "1264": "庄圣贤", "1765": "刘其军", "1478": "袁红平",
        "1683": "崔国栋", "841": "申爱国", "1776": "郭春生", "273": "冯军焕", "1453": "刘春", "2004": "孙江", "964": "陈唐龙", "838": "谢东",
        "16": "jinxichen", "1259": "王莉", "160": "黄海于", "302": "田怀文", "902": "刘蓉华", "1543": "何凤文", "1164": "潘敏",
        "1609": "张继旺", "1466": "蔡小强", "1221": "董时羽", "1194": "阎开印", "130": "薛爱", "784": "闻毓民", "187": "杨涛",
        "1767": "杨鸿泰", "572": "胡骥", "1284": "何华武", "748": "马超英", "2038": "张志厚", "349": "管会生", "177": "孟凡春", "378": "张勇",
        "1473": "唐方方", "1790": "陈元正", "972": "仇文革", "145": "戴杨", "169": "杨斌", "313": "严余松", "716": "戚建淮", "506": "朱本珍",
        "186": "李伦贵", "1316": "徐文生", "105": "樊代和", "1049": "郭进", "897": "黄慧萱", "746": "张志斌", "376": "邱建", "1134": "欣羚",
        "697": "张献州", "830": "陈有真", "52": "李娟", "604": "程世娟", "1135": "肖平", "208": "张娟", "191": "解绍锋", "263": "彭强",
        "960": "潘亚嘉", "1407": "周友龙", "1698": "李远星", "1973": "王先驱", "414": "赵勇", "581": "秦萍", "2050": "张海涛",
        "1152": "张良", "1337": "关振宏", "1101": "于志强", "1258": "陈宇", "1423": "毛钢", "1662": "熊雄", "967": "唐继舜",
        "1979": "杨虎锋", "1868": "李华强", "1995": "王小可", "1146": "马小娟", "776": "江奇", "1759": "刘钰", "546": "于兰英",
        "41": "梅桂明", "142": "张强伟", "198": "张葛祥", "1419": "王长林", "1455": "孔祥彬", "2027": "董立新", "557": "曾勇", "405": "王健鹏",
        "102": "蔡力勋", "708": "李学如", "813": "罗斌", "408": "陈德明", "1235": "姚令侃", "751": "苟锐", "1159": "付建林", "1757": "陈思",
        "1756": "苏斌", "1064": "许志浩", "14": "周国华", "1459": "宋文胜", "2048": "饶书权", "1214": "叶乃沂", "1217": "马倩",
        "1825": "关庆华", "1230": "耿化民", "1175": "蒋良潍", "114": "郭永春", "305": "唐猛", "1314": "刘广宇", "369": "黄兴建",
        "1414": "贾建民", "706": "叶彭姚", "257": "寇玮华", "98": "俞森林", "455": "肖林萍", "1325": "刘飞云", "676": "张文芳",
        "1369": "戴小文", "1793": "卢小钊", "1937": "谭克利", "1637": "杨达", "984": "应松宝", "952": "王志杰", "31": "张杰", "970": "叶勇",
        "887": "罗煜", "1092": "李裕奇", "411": "冯颖", "1971": "李鹏", "1791": "程琰", "941": "赵灿晖", "778": "沈锐利", "932": "陈岩峰",
        "343": "肖建", "2018": "陈松", "1836": "孙亮亮", "282": "帅斌", "1601": "曾祥光", "907": "杨建军", "2014": "唐弦韵",
        "1165": "陈立民", "2003": "杨雁", "1540": "杨琼", "777": "刘海旭", "981": "晋智斌", "699": "魏安", "217": "王开云", "225": "黄涛",
        "1719": "郭海龙", "210": "李映辉", "265": "杨晗", "1381": "金铃", "767": "闫智勇", "1632": "邢焕来", "1458": "俞丽萍",
        "1644": "张迎宾", "1532": "李京肽", "1109": "陈尚云", "1027": "高仕斌", "440": "汪旭光", "1169": "何川", "1172": "范晨光",
        "323": "曾怡达", "180": "郑海涛", "803": "李晓力", "785": "刘平", "795": "高晓蓉", "2025": "周杰", "982": "任伟平", "713": "陈建政",
        "1812": "胥川", "1752": "宋竞", "819": "方勇", "648": "王思琦", "901": "王习明", "1222": "周勋秀", "690": "张艳荣", "1671": "于龙",
        "1677": "赵君文", "268": "陈天星", "159": "陈红梅", "1968": "陈德", "2031": "柯川", "427": "汪启明", "1550": "任慧", "360": "徐京华",
        "1387": "林青", "1925": "栾慧", "1704": "何俊", "717": "李杰", "1054": "王献", "1988": "刘一杰", "1507": "余志斌", "564": "陆可",
        "1340": "李建兵", "222": "唐达培", "884": "蒋鑫", "1646": "冷旷代", "120": "杨岗", "773": "艾长发", "1923": "唐琦", "1189": "刘大刚",
        "536": "马驷", "923": "陈东", "121": "耿维", "235": "董靓", "1186": "马跃", "1840": "张艳斌", "566": "孟文", "739": "占玉林",
        "1268": "金炜东", "1915": "沈旅欧", "133": "娄超", "1048": "陈颖", "1699": "温杨", "338": "王红艳", "1335": "邓君韬",
        "1638": "周福林", "615": "黄天民", "1070": "于丽", "703": "郭俊", "1880": "何庆", "1088": "陆天炜", "1628": "赵章海", "688": "韩敏",
        "1430": "朱成", "253": "钟生军", "798": "罗林", "569": "窦军", "1758": "陈再刚", "308": "王豫", "1282": "孔建", "621": "黄景春",
        "1548": "胡静", "1177": "杨小雪", "890": "徐行言", "1878": "李焰", "874": "张丁丁", "1947": "雷鸣", "879": "刘捍卫", "1497": "苗妙",
        "1734": "曹宝宝", "154": "钟萍", "34": "陈晓浪", "204": "冯德俊", "2013": "许钜秉", "1805": "徐顺刚", "1981": "曾迎",
        "1999": "陈钉均", "1144": "张方", "1490": "曾祥敏", "1298": "林克", "60": "贾唤玉", "1269": "江久文", "1963": "黄代绘",
        "1895": "丁建明", "1633": "翁亚军", "1402": "骆德阳", "1889": "吴丽娟", "811": "耿黎辉", "1950": "傅志坚", "2036": "张松",
        "1577": "王坤", "1745": "郑和平", "1594": "杨璐", "1218": "戴齐", "609": "王鹏飞", "793": "陈民武", "1694": "黄新河",
        "1276": "戴虹", "329": "熊瑛", "1796": "曹鹏", "256": "柳萍", "415": "岑敏仪", "1900": "石章海", "633": "晏飞翔", "106": "贺政纲",
        "711": "赵立力", "311": "黄整", "1501": "张洁", "383": "秦克云", "252": "杨飞", "437": "张雪永", "896": "吴贵凉", "1509": "周海京",
        "1241": "何广杰", "124": "龚正君", "1200": "华春蓉", "980": "赵华", "1035": "张继春", "1244": "黄洪", "1762": "敬霖",
        "1558": "张永莉", "291": "乐源", "58": "周绍兵", "1234": "潘厚宏", "497": "邓跞", "1506": "钟菲菲", "731": "万钧", "136": "刘成清",
        "1208": "柏桦", "382": "朱颖", "1959": "常志旺", "2035": "樊小强", "1517": "潘小燕", "197": "万国江", "1545": "林娜", "26": "栗怀广",
        "172": "江永全", "1025": "余小平", "860": "唐晋生", "1240": "白天蕊", "1689": "姜曼", "46": "燕莆龙", "705": "赵兴权",
        "1477": "郝晓枫", "870": "杨正林", "65": "朱军", "882": "崔圣爱", "1949": "周祎", "1106": "韩太昌", "1969": "王稳", "876": "张聪",
        "434": "赵海良", "1713": "刘承志", "700": "李芳芳", "1608": "张兵", "1108": "赵世春", "1566": "成文佳", "712": "李柏林",
        "1375": "单奇", "1192": "张杰", "934": "周佳媚", "79": "柳葆生", "1879": "张涛", "1289": "李茂红", "1080": "周厚斌",
        "1197": "张俊云", "1829": "杨平", "70": "周伟", "741": "史本山", "55": "徐进", "1693": "曹晓斌-电气工程学院", "15": "周正春",
        "660": "张晓龙", "1425": "张国林", "2019": "易锦", "1993": "雷涵", "24": "官振中", "66": "支锦亦", "1869": "熊俊", "1585": "曹云刚",
        "1339": "赵明", "2081": "夏钰东", "641": "彭川宇", "1398": "王明亮", "1475": "任新红", "816": "李永乐", "430": "胡久梅",
        "950": "范希梅", "888": "陈向东", "1212": "万里翔", "119": "马剑", "1283": "蒋葛夫", "1831": "齐欣", "84": "赵人达", "2043": "蒋淑兰",
        "1626": "郑芳芳", "1717": "张樱子", "1301": "贾欣燕", "355": "吴坚", "1897": "吴海涛", "337": "蒋朝哲", "1382": "王远波",
        "574": "杨苹", "1555": "李翠娟", "1417": "曾代文", "515": "马惠民", "1073": "孙晓丹", "347": "李映红", "116": "雷鸣", "230": "许建平",
        "399": "丁国富", "669": "花欣", "1586": "孙红亮", "359": "高宏力", "1446": "郑小华", "328": "倪文波", "1772": "李晰",
        "1818": "宋美华", "1521": "郑博仁", "36": "蒋阳升", "668": "王国胤", "508": "蒋兴锟", "560": "李传忠", "1250": "王涛", "396": "李岗",
        "432": "柴俭", "563": "牟能冶", "1853": "雷鸣", "1862": "刘建", "248": "章雪岩", "1021": "石毅", "1887": "戴睿武", "652": "林拥军",
        "1740": "周竹", "2001": "黄婷", "450": "施洲", "1619": "王俊国", "158": "冯全源", "1273": "杨巧艳", "1808": "范文博",
        "661": "牟瑞芳", "1991": "杨慧", "975": "耿萍", "1858": "李钢", "1326": "苏谦", "1179": "饶艾", "1356": "郭育华", "1824": "严仲明",
        "522": "荆志东", "1095": "王少华", "734": "吕红霞", "421": "李江", "2011": "黄海凤", "146": "潘金山", "452": "刘冀钊", "48": "谭建",
        "1958": "舒兴川", "1486": "孙晓园", "1664": "徐飞", "849": "丁荣军", "203": "熊春梅", "743": "刘宇杰", "1570": "钱亚旭",
        "525": "李响", "1953": "孟凡彬", "1563": "刘静元", "947": "严健", "1989": "倪宇翔", "259": "马卫华", "1935": "高伟", "745": "何其昌",
        "356": "范莉莉", "314": "何晓琼", "935": "王奔", "1127": "赵慧娟", "231": "江奇", "431": "陈菡", "2009": "李祥云", "1492": "陆霞",
        "85": "钱林茂", "1682": "王晓敏", "1629": "权伟", "878": "董大伟", "43": "王锋", "514": "梁  毅", "184": "王维民", "709": "茆灿泉",
        "505": "阴学军", "898": "刘春尧", "1464": "李学勇", "1819": "郭伟", "1651": "尹冬弟", "1821": "肖新标", "727": "曾明华",
        "1851": "许浒", "602": "李良", "945": "吴积钦", "1297": "胡明川", "1502": "陈小鸥", "1920": "赵春明", "200": "汪建新",
        "309": "许志沛", "39": "向天宇", "2000": "诸波", "606": "段莉萍", "1941": "孙延国", "1803": "王朝明", "547": "楼新远",
        "1926": "董大伟", "909": "李海波", "195": "蒋启龙", "179": "蒋雅君", "1744": "王庆峰", "946": "赵海全", "683": "赖晓东", "442": "徐芒",
        "209": "吴圣川", "567": "吴晓雄", "775": "胡卸文", "1158": "陈春光", "361": "陈永亮", "2084": "魏桂花", "1317": "陈荣武",
        "836": "赵坪锐", "1349": "贺建闽", "922": "潘育山", "1687": "郭泰林", "212": "陈清", "1578": "王立", "737": "刘秀茹", "1769": "郭鹏",
        "223": "王进", "175": "冯晓云", "274": "王红军", "374": "张勤", "322": "晏秋", "814": "曾艳华", "806": "杨树莉", "61": "杨成",
        "869": "邓绍平", "226": "华泽玺", "877": "王群", "701": "赵冬梅", "1022": "鲁芳", "1343": "刘咏梅", "1936": "陈睿智",
        "1312": "赵国堂", "245": "肖蕾", "238": "郭孜政", "1207": "范翠丽", "677": "陈蜀玉", "1315": "谭永东", "1622": "黄俊", "723": "谢进",
        "1980": "付川云", "220": "阳光武", "794": "李远富", "1013": "叶华文", "1042": "刘丹", "249": "谢强", "2082": "张明金",
        "671": "高建强", "495": "周俊勋", "672": "赵阳", "1598": "陈鹏", "914": "李群湛", "694": "董大勇", "1210": "郑凯锋", "229": "杨冰",
        "1352": "杨川", "297": "王文健", "111": "肖世国", "1408": "段宏", "1852": "王文丹", "1368": "孔书祥", "436": "王梅", "868": "罗书学",
        "562": "龚晖", "100": "张铎", "1245": "林国松", "799": "徐跃良", "1148": "蒋朝根", "97": "葛宇东", "1099": "孙克国",
        "1801": "峨眉信息网络中心", "667": "陈光雄", "597": "张旭", "1376": "靳桅", "1118": "刘国祥", "498": "高山", "44": "苏虎",
        "1727": "阳恩慧", "2052": "封顺", "832": "杨晓梅", "1607": "王庆峰", "20": "崔树勋", "118": "谢宁", "286": "程学庆", "843": "童志平",
        "578": "齐华", "137": "姚宁", "426": "冯波", "260": "张祖涛", "1992": "童妍", "966": "尹红风", "132": "罗永坤", "1247": "杨庆华",
        "1870": "王庆松", "271": "石红国", "955": "孙林夫", "240": "陈康", "1966": "闫飞", "858": "马淑霞", "678": "刘艳辉", "1079": "刘文英",
        "576": "于凌云", "1648": "李砚玲", "556": "余南阳", "400": "杨红薇", "261": "江欣国", "1770": "王明文", "1485": "徐友香",
        "1412": "李春晓", "1050": "张红玲", "1228": "张卫华", "2075": "黎定仕", "880": "勾红叶", "740": "崔雅静", "1137": "徐培强",
        "1448": "张岚", "496": "栗健", "1843": "贾洪果", "1841": "余夏云", "1436": "戴宾", "78": "李晓斌", "157": "刘林", "527": "阮航",
        "1327": "杨万理", "1503": "唐咏雪", "1371": "胡鹏飞", "1450": "秦顺全", "1779": "严敏", "920": "张友刚", "1449": "曹洪",
        "519": "刘为民", "670": "肖志辉", "797": "彭伟", "1842": "甘立勇", "594": "钱志鸿", "1416": "刘红梅", "1263": "王莉", "152": "陶宏才",
        "1460": "林圣", "1238": "陈辉", "422": "申瑢", "417": "雷斌", "1332": "颜诗树", "1595": "罗楠", "904": "麦继婷", "298": "张明禄",
        "1237": "陈寿根", "1729": "崔大宾", "538": "陈嵘", "1857": "罗明星", "1886": "汤善宏", "978": "杨兵", "1318": "刘德强",
        "444": "陈强", "1816": "胡海涛", "1260": "龚涛", "1261": "何云庵", "499": "郑光玉", "334": "张继业", "2077": "乔高秀",
        "511": "顾湘生", "1069": "高波", "224": "吴晓", "930": "唐阳", "57": "王斌", "545": "郑史雄", "325": "傅永胜", "346": "施富强",
        "326": "黄运华", "1265": "曾杰", "2020": "赵才友", "192": "葛兴来", "983": "李俊", "953": "沈中伟", "1205": "孟华", "1519": "冯抒琴",
        "886": "杨帆", "1588": "朱奎彬", "2078": "王中宝", "1366": "康亚林", "601": "崔叙", "1309": "张骥冀", "199": "龙绪明", "441": "秦娜",
        "693": "饶翠华", "820": "唐均", "386": "徐扬", "1964": "梁树林", "845": "李相强", "1141": "包陈", "1922": "李成坚", "1871": "张安仁",
        "1125": "易虹岚", "1943": "刘占辉", "1336": "胡建斌", "404": "于凯", "829": "周仲荣", "416": "毕海权", "726": "廖海黎",
        "2022": "智伟", "456": "张天培", "1112": "周晓军", "1329": "郭建强", "2037": "李瀛栩", "1147": "赵立峰", "278": "蹇明",
        "1243": "唐跃勤", "96": "王磊", "1330": "秦军", "77": "王群智", "155": "杨燕", "2054": "赵静雅", "1529": "吕兆新", "900": "张兴国",
        "630": "杨一帆", "543": "江晓禹", "459": "LiuBin", "67": "武守信", "101": "唐燕梅", "1554": "汤习敏", "1709": "朱庆",
        "390": "叶建军", "1184": "蒲明华", "528": "张殿业", "627": "田雪梅", "295": "霍娅敏", "1223": "张克跃", "1899": "郑予捷",
        "1974": "刘海峰", "1255": "李芳宇", "769": "杨青娟", "1859": "胡红", "719": "马建林", "1733": "吴磊", "1656": "苏凯",
        "1828": "赵鑫", "1837": "张晓宇", "1428": "程军", "171": "余立建", "1605": "樊敏", "1848": "王毅", "916": "汪波", "1347": "杨珊",
        "1032": "刘玉珺", "1640": "张路", "1516": "李昊", "276": "罗大兵", "1279": "赵永翔", "639": "王万军", "73": "王建", "761": "王伯铭",
        "285": "易海燕", "1065": "张小荣", "883": "王士民", "1722": "王世明", "1522": "肖晶", "1962": "吴文海", "629": "葛玉梅",
        "611": "吕长竑", "1961": "魏文赋", "410": "黎荣", "839": "张建经", "310": "何薇", "607": "徐晓燕", "1610": "张丽艳", "1627": "贾宏宇",
        "216": "翁杰", "1028": "任平山", "214": "高建敏", "954": "叶子荣", "1720": "张渝", "782": "黄楠", "1467": "徐元栋", "1575": "余丙军",
        "202": "朱志武", "933": "吴毅", "1954": "王青元", "521": "马德芹", "1877": "何次", "1452": "廖少毅", "445": "王君", "242": "张开林",
        "1783": "刘东", "2006": "郭建威", "1463": "李红樱", "1830": "唐兆", "448": "王雪梅", "1394": "池茂儒", "1695": "傅娅",
        "893": "胡建伟", "634": "沈如泉", "103": "肖世德", "1012": "吴广宁", "899": "雷国胜", "81": "范平志", "1754": "朱洁", "1294": "邬平波",
        "516": "王文灿", "770": "张文阳", "725": "马永强", "1531": "周维怡", "1378": "邓燕", "1338": "陈迎新", "895": "钱永久",
        "808": "赵丽平", "1777": "黄艳霞", "1498": "王海玲", "22": "王勇", "592": "昝月稳", "1860": "刘建阳", "844": "李明水", "1631": "周涛",
        "1303": "谢建华", "1443": "刘洲", "493": "袁代林", "88": "吴晓", "1404": "徐兴祥", "1574": "张帼威", "1931": "韩效", "1568": "付飞",
        "1945": "马龙祥", "1143": "熊件根", "2005": "徐臻", "1661": "康黎", "871": "杨洪吉", "1706": "张秋玲", "552": "董海山",
        "201": "张湘", "575": "吴向东", "385": "郑靖", "974": "卜一之", "1038": "尹朝晖", "724": "叶贤东", "852": "陈春阳", "1525": "孙莉萍",
        "219": "王敏锡", "1907": "彭金方", "894": "周克敏", "221": "王晓茹", "1488": "翟东海", "1528": "周兴华", "1562": "李勇",
        "1328": "李成辉", "380": "张红军", "1219": "王玉锁", "1618": "朱涛", "2072": "付国强", "1847": "ShuiquanDeng", "738": "邵长江",
        "1983": "安立楠", "791": "王滢", "2034": "魏凯", "1239": "李达", "790": "李遂焰", "588": "李简瑷", "1203": "陶志平", "969": "漆泰岳",
        "591": "廖楚晖", "170": "景红", "395": "王璐", "1557": "郭瑞", "963": "王枢", "805": "张志强", "1582": "宁静", "95": "赵文",
        "833": "何畏", "1815": "杨志禄", "865": "王明年", "1701": "王金栋", "595": "李子重", "1089": "唐志红", "534": "崔庆", "891": "李明",
        "1856": "张立", "1755": "张瑞", "687": "陈锦雄", "1865": "李珊", "1319": "马国忠", "1789": "张明", "1774": "蒋婧", "1544": "黎斌",
        "1960": "黄艺丹", "1590": "张胜利", "1391": "王顺洪", "59": "祝凤荣", "1996": "陈树伟", "1285": "王郴平", "1242": "王宏霞",
        "502": "郭玉文", "571": "杜宏明", "2024": "杨静晖", "976": "晏为力", "1359": "范建斌", "1668": "郭世伟", "1806": "汪斌",
        "1047": "张雪霞", "387": "韩玫", "1573": "薛锋", "1832": "王明慧", "1875": "周龙甫", "1893": "李华", "1037": "王兴",
        "1910": "周宁", "1081": "魏星", "1313": "许义文", "809": "刘盾", "618": "王长才", "704": "徐华", "149": "侯进", "1068": "韩靖",
        "640": "王争鸣", "353": "刘颖", "651": "张炜", "1115": "蒲黔辉", "1286": "曾勇", "1277": "郑小武", "1786": "王嵩", "1153": "祝兵",
        "1782": "邸志雄", "1213": "唐春勇", "1826": "李婧", "56": "郭秀萍", "1524": "侯斌英", "780": "郝莉", "173": "赵宏宇", "446": "王俊勇",
        "1642": "邵理阳", "1067": "王琳", "1592": "丁军君", "1307": "叶仁荪", "517": "屈  科", "1131": "程馨桥", "370": "白志勇",
        "1457": "雷晓明", "742": "黄曙光", "942": "余国朱", "675": "李志林", "1432": "喻渝", "1085": "陶莹", "1287": "赵菊梅",
        "1921": "王菲", "90": "袁艳平", "718": "李延来", "1823": "秦娜", "913": "张明", "183": "李旭升", "1881": "蔡琳", "1972": "黄德青",
        "92": "周利军", "1351": "黄治清", "1094": "高芳清", "1076": "黄梅", "689": "易建华", "1998": "龚晓颖", "1970": "陈磊",
        "1938": "龙彦", "1386": "吕其兵", "1306": "王德林", "1331": "唐眉江", "658": "张则强", "1421": "濮德璋", "1956": "谷丽瑶",
        "1663": "刘英", "1914": "刘伟群", "544": "喻勇", "1039": "毛坚强", "2062": "吕辉", "1942": "蔡正洪", "637": "李萍",
        "1635": "范美坤", "1374": "黄彦全", "1474": "史迹", "188": "马磊", "864": "覃蓉芳", "64": "鲍洪刚", "76": "陈继兰", "1471": "沈中华",
        "619": "邱忠平", "144": "周斯翔", "1583": "高波", "104": "谢美俊", "532": "黄喜兵", "244": "钟文生", "1302": "晏启鹏", "824": "刘昌清",
        "910": "伍川辉", "1799": "郑东生", "1675": "江磊", "827": "廖海", "885": "王学", "1082": "方纲", "682": "王淑营", "1763": "梁艳",
        "1441": "郭文博", "80": "董亮", "1775": "黄阳", "1929": "杨长卫", "908": "刘志祥", "1271": "王建英", "1023": "李贵森",
        "1781": "黄曜辉", "439": "吴光", "275": "胡书春", "1523": "徐中怡", "857": "周嘉南", "656": "张家树", "810": "蒋玉石", "113": "邱延峻",
        "1602": "童建军", "958": "冯鉴", "1034": "何平", "1454": "张文远", "924": "陈丽华", "1120": "许炜萍", "2046": "马锋",
        "1167": "胡晓鹏", "17": "周国华", "279": "范东明", "551": "鲁丽", "807": "周嘉裕", "1253": "丁静", "393": "阳锐顺", "83": "刘哲",
        "1224": "邓敬", "1660": "师明星", "128": "刘义全", "1162": "陈家宏", "1470": "周庭锐", "1483": "闫月勤", "301": "殷勇",
        "280": "卢晓英", "401": "蒋宁平", "1924": "吴昊", "646": "李永树", "1944": "朱胜阳", "1850": "王彬", "764": "禹华谦",
        "1405": "胡剑忠", "744": "谭睿", "961": "夏世芬", "140": "刘胤", "504": "马如坤", "1930": "黄媛", "1401": "王牣", "1533": "徐勋",
        "1154": "何耀琴", "2057": "吕苗苗", "1679": "易安林", "1617": "杜润", "2065": "王邦继", "1254": "陆绍凯", "91": "胡洪斌",
        "1730": "康锐", "686": "赵元聪", "1445": "代小舟", "1967": "熊耀华", "680": "张杨", "71": "方旭明", "1712": "李金龙", "735": "胡岷",
        "53": "黄进", "765": "彭宇明", "205": "周乐韬", "624": "冉绵惠", "755": "唐小虎", "1074": "黄登仕", "1669": "郭蕾", "1487": "金艾",
        "1442": "郭世明", "1078": "廖成", "1020": "吕群", "861": "谢南星", "1692": "滕飞", "1444": "温贤秀", "1119": "郑余朝",
        "1674": "张静", "428": "秦剑", "1168": "王文勇", "2028": "张楠", "99": "卢耀辉", "1308": "永远", "715": "曹新文", "554": "王国志",
        "580": "杨杰", "1934": "张诗婷", "1723": "李路", "1246": "陈小川", "1994": "赵军", "1178": "张玉学", "1410": "张立民",
        "1514": "胡霞", "373": "高山", "165": "陈庆春", "447": "王伯鲁", "1710": "李一员", "645": "李瑞雪", "277": "刘晓波", "1773": "何圣仲",
        "2064": "唐灯", "599": "鞠廷英", "1705": "陈渝萍", "951": "宋冰", "881": "黄云德", "288": "谭献海", "1059": "华超",
        "1496": "吴山倩文", "535": "邓丽", "1103": "潘家鼎", "792": "李星", "673": "郭年根", "1500": "王焰", "1827": "向活跃", "166": "朱焱",
        "1461": "梁涛", "1201": "张文桂", "828": "单承戈", "1834": "张强锋", "236": "缪炳荣", "110": "王轶文", "847": "王英学",
        "2063": "刘思婧", "51": "卫星", "2076": "王凡", "1625": "杨建", "647": "李雪芹", "1804": "李瑞芳", "2026": "胡春峰", "550": "蒋正红",
        "1117": "周小红", "1916": "游为", "122": "潘毅", "1726": "肖林萍", "237": "田永秀", "1892": "于波涛", "1518": "陈亭伊",
        "1096": "王辉", "1440": "余江", "30": "鲁雄", "1176": "富海鹰", "451": "单德山", "1058": "熊巧", "730": "唐智慧", "2058": "陈全芳",
        "1849": "陈静青", "1231": "李科平", "1833": "祝乔", "664": "王自力", "1066": "王振辉", "1128": "夏招广", "391": "李芾",
        "753": "田俐萍", "317": "安维胜", "234": "彭其渊", "1367": "梁明学", "134": "和红杰", "449": "李春", "161": "阚前华", "1063": "金桂林",
        "1955": "赵菁", "1045": "张育智", "1360": "李奇", "1797": "圣小珍", "1196": "刘争平", "1749": "李茜", "625": "杨安文",
        "756": "胡子祥", "568": "张新有", "1161": "龚伦", "182": "甘蜜", "906": "张仲鹏", "1788": "陈敏", "29": "冷永祥", "589": "张锦",
        "453": "郭红玲", "1434": "苗苗", "1104": "王成璋", "1645": "罗小军", "1685": "郑良", "429": "柯坚", "840": "郭强", "593": "李人宪",
        "1333": "曹保江", "1102": "章慧健", "608": "韩正庆", "553": "谢云丽", "1614": "杨春燕", "384": "林建辉", "1083": "杨琴",
        "1863": "赵志明", "54": "朱宏娜", "1233": "徐柱", "156": "何蓉", "293": "陈强", "1385": "王永立", "570": "舒波", "859": "唐茂林",
        "1185": "李力", "1193": "朱艳", "1389": "敬永春", "1552": "杨世蓉", "1499": "李海振", "612": "王建琼", "623": "何晓川",
        "1388": "郝辽钢", "628": "支宇", "304": "沈火明", "1272": "尹忠科", "131": "周正峰", "1747": "田菲菲", "2007": "戴若愚",
        "1225": "曹中清", "1680": "蒋小松", "710": "王弘", "377": "王月明", "973": "肖清华", "752": "叶跃忠", "1365": "杨敏", "433": "王永杰",
        "834": "苏兆国", "32": "马祖军", "763": "林伯海", "38": "郭春", "758": "陈彦如", "926": "王正彬", "303": "陈滋利", "1482": "邓发云",
        "925": "吴刚", "1946": "邱忠才", "1835": "徐晓玲", "112": "马存明", "1738": "杨玉容", "620": "杨立中", "107": "聂佳佳", "949": "冯君",
        "510": "许再良", "771": "朱宏泉", "1122": "邓荣贵", "1684": "刘建涛", "2080": "吴然", "2039": "孙柏", "1420": "骆玲",
        "168": "康国政", "1493": "邓亚红", "1052": "李永泉", "1439": "余志祥", "1292": "苏志宏", "759": "李妍峰", "1435": "周伦",
        "665": "于兰峰", "1636": "覃世艳", "394": "陈光", "150": "何正友", "1216": "钟毅", "501": "陈建东", "1199": "李军", "555": "温泽峰",
        "779": "秦应兵", "644": "邓志辉", "587": "唐家银", "458": "赵联文", "957": "吴德利", "1130": "郑宏明", "364": "陈俊敏",
        "2049": "陈艳秋", "1170": "李成金", "1489": "谢瓯", "754": "张震宇", "1802": "彭道平", "143": "冯菊", "1520": "曾建",
        "1262": "郑亚非", "1062": "王勇", "344": "周斌", "1742": "张宇", "1311": "尹立雪", "631": "康积涛", "863": "万萱", "1229": "张红",
        "598": "黄松和", "1355": "李宗平", "1846": "梁宏斌", "542": "柯玲", "892": "万军", "850": "魏俊轩", "1040": "祝莹", "1696": "朱宗涛",
        "332": "巫锡勇", "1739": "徐英雷", "1659": "胡广地", "62": "张同刚", "1560": "杜军", "944": "吴小平", "1604": "涂秋芬",
        "1110": "周东升", "1341": "彭肜", "1400": "钱清泉", "1564": "李维余", "354": "罗世辉", "2071": "何丽娜", "1902": "黄高勇",
        "1226": "曾京", "520": "王化光", "167": "张翠芳", "1451": "雷叙川", "2066": "郭冀岭", "1724": "张鲲", "774": "史智",
        "1580": "杨健维", "151": "闫连山", "306": "户佐安", "269": "张建强", "345": "程谦恭", "409": "杨宝莹", "1612": "唐由海",
        "300": "左大杰", "1191": "刘凤", "63": "冯春", "691": "魏屹", "1465": "孙玉平", "1267": "李自芬", "1513": "廖崇德", "1236": "肖杰灵",
        "600": "雷波", "33": "代颖", "1688": "黄兴民", "915": "张怡", "1043": "华少庠", "655": "杨峰", "1160": "刘欣宇", "1686": "张敏",
        "1150": "金学松", "141": "高增安", "789": "张剑", "513": "孟祥连", "1809": "文超", "1060": "闫兵", "1046": "孙永奎", "749": "王数财",
        "1206": "钟永祥", "283": "钟晓春", "213": "李启彬", "215": "楚珑晟", "1913": "向伟铭", "228": "李海", "1469": "宁维卫",
        "650": "黄志辉", "1984": "高燕", "1649": "陈罗平", "1220": "王化光", "1372": "于苏俊", "289": "史炎", "11": "马光同", "2016": "刘波",
        "707": "叶文霞", "492": "张爱丽", "2040": "钱紫华", "822": "夏嵩", "1415": "李志辉", "1093": "杨其新", "583": "吴茵", "657": "王侃",
        "1427": "吴小玲", "1163": "苏小桦", "825": "王泽勇", "1715": "钟选明", "1510": "管锐", "2056": "田原", "1014": "肖作平",
        "1647": "王欢", "940": "姚昌荣", "181": "王小敏", "1377": "李松", "93": "王文涛", "1624": "李田", "801": "刘庆想", "1711": "刘拥军",
        "74": "乔少杰", "1553": "郑晓彤", "1123": "赖荣", "1746": "乐嘉陵", "1357": "林国斌", "911": "朱德贵", "579": "何德文",
        "1665": "慎利", "108": "熊永良", "1145": "王丹", "1725": "唐莉英", "1928": "雷敏", "89": "林文斌", "985": "余洲", "287": "刘桓龙",
        "1380": "金键", "1015": "黄文方", "1188": "张昆仑", "1896": "张毅捷", "1898": "江丹", "258": "徐菱", "1798": "余敏",
        "977": "郑黎明", "1718": "陈辉", "1681": "于洋", "821": "王黎", "1362": "陈维荣", "1084": "李朝晖", "1342": "朱健梅", "69": "高磊",
        "1511": "涂阳敦", "1838": "遆鹏", "1535": "黄琳娜", "1320": "武小林", "1142": "吴兴序", "851": "许俐", "1447": "向仲敏",
        "1151": "毕凌岚", "1155": "王冲", "1295": "罗荣", "1395": "邓乐", "2008": "康明惠", "1764": "洪西进", "1077": "江南",
        "875": "权高峰", "379": "邱小平", "1702": "郑爽英", "320": "汤家法", "800": "解秀琴", "109": "张翔", "1927": "张亚丽",
        "1113": "缪根生", "649": "晏寄夫", "2070": "陈龙飞", "2060": "刘永中", "1716": "王骑", "1753": "刘桂花", "1589": "张迅",
        "1538": "陈华", "281": "唐慧佳", "1911": "wangsm", "1932": "李然", "1814": "吴学杰", "1571": "韩楠", "250": "肖峰",
        "1572": "张淼", "1600": "唐鹏", "590": "刘旭宝", "786": "林建泉", "636": "李恒超", "1615": "贾玲利", "1354": "蒲云", "1978": "袁红",
        "340": "王培俊", "2059": "高峰", "267": "郭小舟", "1479": "商拓", "1334": "兰强", "526": "赵新益", "239": "赵安莎", "1138": "黄晓钟",
        "509": "肖道坦", "1033": "王倩", "1187": "莫继良", "968": "林荣", "1291": "高力", "115": "罗俊强", "1350": "陈俊", "1986": "罗胜年",
        "1107": "田凯", "1075": "黄雄军", "494": "张清华", "1198": "赵婧", "1071": "罗宁", "13": "徐腾飞", "1403": "李国芳", "1567": "徐鹏"}

schoolindex = {
    '空':10613000,
    '土木工程学院':10613001,
    '机械工程学院':10613002,
    '电气工程学院':10613003,
    '信息科学与技术学院':10613004,
    '经济管理学院':10613005,
    '外国语学院':10613006,
    '交通运输与物流学院':10613007,
    '材料科学与工程学院':10613008,
    '地球科学与环境工程学院':10613009,
    '建筑与设计学院':10613010,
    '物理科学与技术学院':10613011,
    '人文学院':10613012,
    '公共管理与政法学院':10613013,
    '生命科学与工程学院':10613014,
    '力学与工程学院':10613015,
    '数学学院':10613016,
    '马克思主义学院':10613017,
    '心理研究与咨询中心':10613018,
    '工程训练中心':10613019,
    '体育工作部':10613020,
    '茅以升学院（唐臣书院）':10613021,
    '詹天佑学院':10613022,
    '医学院（临床医学院、基础医学院）':10613023,
    '利兹学院':10613024,
    '国际创新创业学院':10613025,
    '竺可桢书院':10613026,
    '牵引动力国家重点实验室':10613027,
    '超导与新能源研究开发中心':10613028,
}

if __name__ == "__main__":
    num = 13
    fp = open('D:/data/xinanTU/xinanTU_teacher_new.txt', 'w')
    fp.write('[')
    for num in range(13,2000):
        prereadydata={}
        (html,imgurl)=getHtml("http://homepage.swjtu.edu.cn/Home/transfer.aspx?ID="+str(num))
        if(html!=None):
             soup = BeautifulSoup(html,'html.parser')
             if ((soup.find('link',href="css/style.css") and not soup.find('link',href="css/Default.css")) or soup.find('link',href="CSS/basic.css")):
                try:
                    items = soup.findAll('div', class_='mo')
                    title_flag = 0
                    degree_flag = 0
                    school_flag = 0
                    school = '空'
                    prereadydata['school'] = school
                    prereadydata['schoolcode'] = str(schoolindex[school])
                    prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                    for item in items:
                        if item.div.span.string == "基本信息":
                            basic = item.find('div', class_='nr').findAll('p')
                            i = 0
                            while (i < len(basic)):
                                if title_flag != 1:
                                    if re.search(u'副教授', basic[i].get_text()):
                                        prereadydata['title']='副教授'
                                        title_flag = 1
                                    elif re.search(u'教授', basic[i].get_text()):
                                        prereadydata['title'] = '教授'
                                        title_flag = 1
                                    elif re.search(u'讲师', basic[i].get_text()):
                                        prereadydata['title'] = '讲师'
                                        title_flag = 1
                                    elif re.search(u'副研究员', basic[i].get_text()):
                                        prereadydata['title'] = '副研究员'
                                        title_flag = 1
                                    elif re.search(u'研究员', basic[i].get_text()):
                                        prereadydata['title'] = '研究员'
                                        title_flag = 1
                                    elif re.search(u'高级工程师', basic[i].get_text()):
                                        prereadydata['title'] = '高级工程师'
                                        title_flag = 1
                                if degree_flag != 1:
                                    if re.search(u'博士', basic[i].get_text()):
                                        prereadydata['degree'] = '博士'
                                        degree_flag = 1
                                    elif re.search(u'硕士', basic[i].get_text()):
                                        prereadydata['degree'] = '硕士'
                                        degree_flag = 1
                                if degree_flag and degree_flag == 1:
                                    break
                                else:
                                    i = i + 1
                        elif item.div.span.string == "个人简介":
                                if item.find('div', class_='nr')!=None:
                                    basicinfo = item.find('div', class_='nr').get_text().strip()
                                    prereadydata['introduction'] = basicinfo
                                    if title_flag != 1:
                                        if re.search(u'副教授', basicinfo):
                                            prereadydata['title'] = '副教授'
                                            title_flag = 1
                                        elif re.search(u'教授', basicinfo):
                                            prereadydata['title'] = '教授'
                                            title_flag = 1
                                        elif re.search(u'讲师', basicinfo):
                                            prereadydata['title'] = '讲师'
                                            title_flag = 1
                                        elif re.search(u'副研究员', basicinfo):
                                            prereadydata['title'] = '副研究员'
                                            title_flag = 1
                                        elif re.search(u'研究员', basicinfo):
                                            prereadydata['title'] = '研究员'
                                            title_flag = 1
                                        elif re.search(u'高级工程师', basicinfo):
                                            prereadydata['title'] = '高级工程师'
                                            title_flag = 1
                                    if degree_flag != 1:
                                        if re.search(u'博士', basicinfo):
                                            prereadydata['degree'] = '博士'
                                            degree_flag = 1
                                        elif re.search(u'硕士', basicinfo):
                                            prereadydata['degree'] = '硕士'
                                            degree_flag = 1
                                    if school_flag != 1:
                                        if re.search(u'土木', basicinfo):
                                            school = '土木工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'机械', basicinfo):
                                            school = '机械工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'电气', basicinfo):
                                            school = '电气工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'信息', basicinfo):
                                            school = '信息科学与技术学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'经济', basicinfo):
                                            school = '经济管理学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'外国', basicinfo):
                                            school = '外国语学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'交通', basicinfo):
                                            school = '交通运输与物流学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'材料', basicinfo):
                                            school = '材料科学与工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'地球', basicinfo):
                                            school = '地球科学与环境工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'建筑', basicinfo):
                                            school = '建筑与设计学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'物理', basicinfo):
                                            school = '物理科学与技术学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'人文', basicinfo):
                                            school = '人文学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'管理', basicinfo):
                                            school = '公共管理与政法学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'生命', basicinfo):
                                            school = '生命科学与工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'力学', basicinfo):
                                            school = '力学与工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'数学', basicinfo):
                                            school = '数学学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'马克思', basicinfo):
                                            school = '马克思主义学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'心理', basicinfo):
                                            school = '心理研究与咨询中心'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'训练中心', basicinfo):
                                            school = '工程训练中心'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'体育', basicinfo):
                                            school = '体育工作部'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'茅以升', basicinfo):
                                            school = '茅以升学院（唐臣书院）'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'詹天佑', basicinfo):
                                            school = '詹天佑学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'医学', basicinfo):
                                            school = '医学院（临床医学院、基础医学院）'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'利兹', basicinfo):
                                            school = '利兹学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'创新创业', basicinfo):
                                            school = '国际创新创业学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'牵引', basicinfo):
                                            school = '牵引动力国家重点实验室'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'超导', basicinfo):
                                            school = '超导与新能源研究开发中心'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                        elif item.div.span.string == "研究方向" or item.div.span.string == "主要研究方向" or item.div.span.string == "研究兴趣":
                                if item.find('div', class_='nr') != None:
                                    majorfield = item.find('div', class_='nr').get_text().strip()
                                    prereadydata['experience'] = majorfield
                                    basicinfo = majorfield
                                    if school_flag != 1:
                                        if re.search(u'土木', basicinfo):
                                            school = '土木工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'机械', basicinfo):
                                            school = '机械工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'电气', basicinfo):
                                            school = '电气工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'信息', basicinfo):
                                            school = '信息科学与技术学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'经济', basicinfo):
                                            school = '经济管理学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'外国', basicinfo):
                                            school = '外国语学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'交通', basicinfo):
                                            school = '交通运输与物流学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'材料', basicinfo):
                                            school = '材料科学与工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'地球', basicinfo):
                                            school = '地球科学与环境工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'建筑', basicinfo):
                                            school = '建筑与设计学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'物理', basicinfo):
                                            school = '物理科学与技术学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'人文', basicinfo):
                                            school = '人文学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'管理', basicinfo):
                                            school = '公共管理与政法学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'生命', basicinfo):
                                            school = '生命科学与工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'力学', basicinfo):
                                            school = '力学与工程学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'数学', basicinfo):
                                            school = '数学学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'马克思', basicinfo):
                                            school = '马克思主义学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'心理', basicinfo):
                                            school = '心理研究与咨询中心'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'训练中心', basicinfo):
                                            school = '工程训练中心'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'体育', basicinfo):
                                            school = '体育工作部'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'茅以升', basicinfo):
                                            school = '茅以升学院（唐臣书院）'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'詹天佑', basicinfo):
                                            school = '詹天佑学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'医学', basicinfo):
                                            school = '医学院（临床医学院、基础医学院）'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'利兹', basicinfo):
                                            school = '利兹学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'创新创业', basicinfo):
                                            school = '国际创新创业学院'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'牵引', basicinfo):
                                            school = '牵引动力国家重点实验室'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                                        elif re.search(u'超导', basicinfo):
                                            school = '超导与新能源研究开发中心'
                                            prereadydata['school'] = school
                                            prereadydata['schoolcode'] = str(schoolindex[school])
                                            prereadydata['identifycode'] = str(schoolindex[school] * 100000 + int(num))
                                            school_flag = 1
                        elif item.div.span.string == "联系方式":
                                if item.find('div', class_='nr') != None:
                                    contacts = item.find('div', class_='nr').findAll('p')
                                    for contact in contacts:
                                        email = re.search(u'电子邮箱：(.*?)$', contact.get_text().strip())
                                        if email:
                                                prereadydata['email'] = email.group()[5:]
                    if title_flag or degree_flag or school_flag == 1:
                            try:
                                    name = namesheet[str(num)]
                                    prereadydata['name'] = name
                                    readydata = json.dumps(prereadydata, ensure_ascii=False)
                                    fp.write(readydata+',')
                            except:
                                    continue
                except:
                        continue
    fp.write(']')
    fp.close()

